-----------------------------------------------------------------------------------------
-- Отсортируйте данные по полю заработная плата:
-----------------------------------------------------------------------------------------
-- По удыванию:
SELECT *
FROM staff
ORDER BY salary DESC;
-- По возрастанию:
SELECT *
FROM staff
ORDER BY salary;
-----------------------------------------------------------------------------------------
-- Выведите 5 максимальных заработных плат:
-----------------------------------------------------------------------------------------
SELECT salary
FROM staff
ORDER BY salary DESC
LIMIT 5;
-----------------------------------------------------------------------------------------
-- Посчитайте суммарную зарплату по каждой специальности:
-----------------------------------------------------------------------------------------
SELECT post, SUM(salary) as sum_salary
FROM staff
GROUP BY post;
-----------------------------------------------------------------------------------------
-- Найдите кол-во сотрудников с специальностью «Рабочий»,
-- в возрасте от 24 до 49 лет включительно:
-----------------------------------------------------------------------------------------
SELECT COUNT(*) as `number of young`
FROM staff
WHERE post = 'Рабочий' 
AND age >= 24 
AND age <= 49;
-----------------------------------------------------------------------------------------
--Найдите количество специальностей:
-----------------------------------------------------------------------------------------
SELECT COUNT(DISTINCT post) as `count post`
FROM staff;
-----------------------------------------------------------------------------------------
-- Выведите специальности, 
-- у которых средний возраст сотрудников меньше 30 лет включительно:
-----------------------------------------------------------------------------------------
SELECT post
FROM staff
GROUP BY post
HAVING AVG(age) <= 30;