-------------------------------------------------------------------------------------
-- 1. Используя оператор ALTER TABLE, установите внешний ключ в одной из таблиц:
------------------------------------------------------------------------------------- 
ALTER TABLE posts
ADD CONSTRAINT fk_user_id
FOREIGN KEY (user_id)
REFERENCES clients (id);

-------------------------------------------------------------------------------------
-- 2. Без оператора JOIN, верните заголовок публикации, текст с описанием, 
-- идентификатор клиента, опубликовавшего публикацию и логин данного клиента.
-------------------------------------------------------------------------------------
SELECT p.title, p.full_text, p.user_id, c.login
FROM posts as p, clients as c
WHERE p.user_id = c.id;

-------------------------------------------------------------------------------------
-- 3. Выполните поиск  по публикациям, автором которых является клиент "Mikle".
-------------------------------------------------------------------------------------
SELECT p.id as posts_id, p.title, c.id as clients_id, c.login
from posts as p join clients as c
on p.user_id = c.id
WHERE c.login = "Mikle"; 