------------------------------------------------------
-- Вывести всех котиков по магазинам
------------------------------------------------------
SELECT name, shopname
FROM shops s JOIN cats c
ON s.id = c.shops_id;
------------------------------------------------------
-- Вывести магазин, в котором продается кот “Мурзик”
------------------------------------------------------
SELECT shopname
FROM shops s JOIN cats c
ON s.id = c.shops_id
WHERE c.name = "Murzik";
------------------------------------------------------
-- Вывести магазины, в которых НЕ продаются коты “Мурзик” и “Zuza”
------------------------------------------------------
SELECT shopname
FROM shops
WHERE id NOT IN (
    SELECT shops_id
    FROM cats
    WHERE name IN ('Murzik', 'Zuza'));
------------------------------------------------------
-- Вывести название и цену для всех анализов, которые продавались 5 февраля 2020 и всю следующую неделю.
------------------------------------------------------
SELECT an_name, an_price
FROM analysis a JOIN Orders o
ON a.an_id = o.ord_an
WHERE o.ord_datetime >= '2020-02-05 00:00:00'
	AND o.ord_datetime <= '2020-02-12 00:00:00';
    